[
    {
    "codigo": 1,
    "nombreEjercicio": "Sentadillas",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Párate con los pies separados al ancho de los hombros. Baja lentamente como si te fueras a sentar en una silla, manteniendo la espalda recta y las rodillas alineadas con los pies. Este ejercicio fortalece las piernas y los glúteos."
    },
    {
    "codigo": 2,
    "nombreEjercicio": "Flexiones",
    "series": 4,
    "repeticiones": 20,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Coloca las manos en el suelo alineadas con los hombros y extiende las piernas. Mantén el cuerpo recto y baja el pecho hacia el suelo. Este ejercicio trabaja el pecho, los hombros y los tríceps."
    },
    {
    "codigo": 3,
    "nombreEjercicio": "Plancha",
    "series": 3,
    "repeticiones": "Mantener durante 30 segundos",
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Apóyate en los antebrazos y las puntas de los pies, manteniendo el cuerpo recto. Este ejercicio fortalece el core y mejora la estabilidad."
    },
    {
    "codigo": 4,
    "nombreEjercicio": "Peso muerto",
    "series": 3,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Con una barra frente a ti, flexiona las rodillas y baja el torso para agarrarla. Levántala manteniendo la espalda recta. Este ejercicio trabaja la espalda baja, los glúteos y los isquiotibiales."
    },
    {
    "codigo": 5,
    "nombreEjercicio": "Press de banca",
    "series": 4,
    "repeticiones": 10,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Acuéstate en un banco plano y baja la barra hasta el pecho, luego empújala hacia arriba. Este ejercicio es ideal para desarrollar el pecho, los hombros y los tríceps."
    },
    {
    "codigo": 6,
    "nombreEjercicio": "Remo con barra",
    "series": 3,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Inclina el torso hacia adelante con una barra en las manos y tira de la barra hacia el abdomen. Este ejercicio fortalece la espalda y los bíceps."
    },
    {
    "codigo": 7,
    "nombreEjercicio": "Press militar",
    "series": 4,
    "repeticiones": 10,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Sujeta una barra a la altura de los hombros y empújala hacia arriba hasta que los brazos estén extendidos. Este ejercicio es excelente para desarrollar los hombros."
    },
    {
    "codigo": 8,
    "nombreEjercicio": "Curl de bíceps con barra",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Sujeta una barra con las manos a la altura de las caderas y flexiona los codos para levantar la barra hacia los hombros. Este ejercicio trabaja los bíceps."
    },
    {
    "codigo": 9,
    "nombreEjercicio": "Extensiones de tríceps en polea",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Sujeta la cuerda de una polea alta y extiende los brazos hacia abajo hasta que estén completamente rectos. Este ejercicio fortalece los tríceps."
    },
    {
    "codigo": 10,
    "nombreEjercicio": "Elevaciones laterales",
    "series": 3,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Sujeta una mancuerna en cada mano y levanta los brazos hacia los lados hasta que estén a la altura de los hombros. Este ejercicio trabaja los hombros."
    },
    {
    "codigo": 11,
    "nombreEjercicio": "Abdominales en el suelo",
    "series": 3,
    "repeticiones": 20,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Acuéstate boca arriba con las rodillas flexionadas y las manos detrás de la cabeza. Levanta el torso hacia las rodillas contrayendo los abdominales. Este ejercicio fortalece el abdomen."
    },
    {
    "codigo": 12,
    "nombreEjercicio": "Puente de glúteos",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Acuéstate boca arriba con las rodillas flexionadas y los pies en el suelo. Levanta las caderas hacia el techo contrayendo los glúteos. Este ejercicio es excelente para fortalecer los glúteos y la espalda baja."
    },
    {
    "codigo": 13,
    "nombreEjercicio": "Zancadas",
    "series": 3,
    "repeticiones": "12 por pierna",
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Da un paso adelante con una pierna y baja el cuerpo hasta que ambas rodillas formen un ángulo de 90 grados. Vuelve a la posición inicial y repite con la otra pierna. Este ejercicio trabaja las piernas y los glúteos."
    },
    {
    "codigo": 14,
    "nombreEjercicio": "Jalón al pecho",
    "series": 3,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Sujeta la barra de una polea alta con las manos separadas más allá del ancho de los hombros. Tira de la barra hacia el pecho mientras mantienes la espalda recta. Este ejercicio fortalece la espalda y los bíceps."
    },
    {
    "codigo": 15,
    "nombreEjercicio": "Press de pierna en máquina",
    "series": 4,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Siéntate en la máquina de press de pierna y coloca los pies en la plataforma. Empuja la plataforma hacia arriba extendiendo las piernas, luego baja lentamente a la posición inicial. Este ejercicio trabaja los cuádriceps, glúteos y pantorrillas."
    },
    {
    "codigo": 16,
    "nombreEjercicio": "Elevación de talones (Gemelos)",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Párate con la punta de los pies en el borde de una superficie elevada y los talones colgando. Levanta los talones lo más alto posible, luego baja lentamente. Este ejercicio fortalece los gemelos."
    },
    {
    "codigo": 17,
    "nombreEjercicio": "Curl de piernas en máquina",
    "series": 3,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Acuéstate boca abajo en la máquina de curl de piernas y ajusta el rodillo por encima de los tobillos. Flexiona las rodillas para levantar el rodillo hacia los glúteos, luego baja lentamente. Este ejercicio fortalece los isquiotibiales."
    },
    {
    "codigo": 18,
    "nombreEjercicio": "Press Arnold",
    "series": 4,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Sujeta una mancuerna en cada mano frente al pecho con las palmas mirando hacia ti. Presiona las pesas hacia arriba girando las palmas hacia adelante. Este ejercicio trabaja los hombros y el pecho."
    },
    { "codigo": 19,
    "nombreEjercicio": "Remo en máquina",
    "series": 4,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",    
    "detalle": "Siéntate en la máquina de remo y sujeta las manillas. Tira de ellas hacia el abdomen manteniendo la espalda recta. Este ejercicio fortalece la espalda y los bíceps."
    },
    { "codigo": 20,
    "nombreEjercicio": "Elevaciones de piernas",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Acuéstate boca arriba con las manos debajo de los glúteos. Levanta las piernas juntas hacia el techo manteniéndolas rectas, luego baja lentamente sin tocar el suelo. Este ejercicio trabaja los abdominales inferiores."
    },
    { "codigo": 21,
    "nombreEjercicio": "Patada de tríceps con mancuerna",
    "series": 3,
    "repeticiones": 12,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Inclina el torso hacia adelante con una mancuerna en una mano y el codo flexionado a 90 grados. Extiende el brazo hacia atrás hasta que esté recto, luego vuelve a la posición inicial. Este ejercicio fortalece los tríceps."
    },
    {
    "codigo": 22,
    "nombreEjercicio": "Crunch en máquina",
    "series": 3,
    "repeticiones": 15,
    "foto": "./imagenes/Sentadillas.webp",
    "video": "",
    "detalle": "Siéntate en la máquina de crunch y coloca las manos en las manillas. Flexiona el torso hacia adelante contrayendo los abdominales, luego regresa a la posición inicial. Este ejercicio trabaja los músculos abdominales." 
    } 
    ]
